InformationRegisters/КлючевыеДолжностиКадровогоРезерва.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КлючевыеДолжностиКадровогоРезерва</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КлючевыеДолжностиКадровогоРезерва/Forms/КлючевыеДолжности/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузитьКлючевыеДолжности();
	УстановитьПредставленияПодразделений();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Оповестить("ЗаписаныКлючевыеДолжности");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = ЭтотОбъект И ИмяСобытия = "ИзмененыПодразделения" Тогда
		ЗагрузитьПодразделения(Параметр.Должность, Параметр.Подразделения);
		ЗаписатьКлючевыеДолжности();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКлючевыеДолжности

&НаКлиенте
Процедура КлючевыеДолжностиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.КлючевыеДолжностиПодразделения Тогда
		ПараметрыФормы = Новый Структура("Должность, Подразделения", 
			ТекущиеДанные.Должность,
			ТекущиеДанные.Подразделения.ВыгрузитьЗначения());
		ОткрытьФорму("ОбщаяФорма.ЗаполнениеПодразделенийКлючевыхДолжностей",
			ПараметрыФормы, ЭтотОбъект, Новый УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлючевыеДолжностиПриИзменении(Элемент)
	ЗаписатьКлючевыеДолжности();
КонецПроцедуры

&НаКлиенте
Процедура КлючевыеДолжностиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьВыборКлючевыхДолжностей(ВыбранноеЗначение);
	ЗаписатьКлючевыеДолжности();
	
КонецПроцедуры

&НаКлиенте
Процедура КлючевыеДолжностиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	НачатьПодборДолжностей();
	
КонецПроцедуры

&НаКлиенте
Процедура КлючевыеДолжностиПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.КлючевыеДолжности.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Удалить ключевую должность?'");
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ТекущиеДанные", ТекущиеДанные);
		
	Оповещение = Новый ОписаниеОповещения("КлючевыеДолжностиПередУдалениемЗавершение", ЭтотОбъект, ПараметрыОповещения);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	КлючевыеДолжности.Очистить();
	
	ЗагрузитьКлючевыеДолжности();
	УстановитьПредставленияПодразделений();
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	НачатьПодборДолжностей();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция АдресПодобранныхДолжностей()
	Возврат ПоместитьВоВременноеХранилище(КлючевыеДолжности.Выгрузить().ВыгрузитьКолонку("Должность"));
КонецФункции

&НаСервере
Процедура ЗаписатьКлючевыеДолжности()
	
	НаборЗаписей = РегистрыСведений.КлючевыеДолжностиКадровогоРезерва.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Для Каждого Строка Из КлючевыеДолжности Цикл
		Если Строка.Подразделения.Количество() = 0 Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Должность = Строка.Должность;
		Иначе
			Для Каждого Подразделение Из Строка.Подразделения Цикл
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Должность = Строка.Должность;
				НоваяЗапись.Подразделение = Подразделение.Значение;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПодборДолжностей()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("АдресСпискаПодобранных", АдресПодобранныхДолжностей());
	ОткрытьФорму("Справочник.Должности.ФормаСписка", ПараметрыФормы, Элементы.КлючевыеДолжности,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборКлючевыхДолжностей(ВыбранноеЗначение)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Значение Из ВыбранноеЗначение Цикл
		НоваяСтрока = КлючевыеДолжности.Добавить();
		НоваяСтрока.Должность = Значение;
		НоваяСтрока.ПодразделенияСтрокой = НСтр("ru = 'Все подразделения'");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПодразделения(Должность, Подразделения)
	
	НайденныеСтроки = КлючевыеДолжности.НайтиСтроки(Новый Структура("Должность", Должность));
	Если НайденныеСтроки.Количество() = 1 Тогда
		НайденнаяСтрока = НайденныеСтроки[0];
		Если Подразделения.Количество() = 0 Тогда
			НайденнаяСтрока.Подразделения.Очистить();
			НайденнаяСтрока.ПодразделенияСтрокой = НСтр("ru = 'Все подразделения'");
		Иначе
			НайденнаяСтрока.Подразделения.ЗагрузитьЗначения(Подразделения);
			ПодразделенияТекст = "";
			Если Подразделения.Количество() >= 5 Тогда
				ПодразделенияТекст = СтрШаблон(НСтр("ru = '%1 подразделений'"), Подразделения.Количество());
			Иначе
				Для Каждого Подразделение Из Подразделения Цикл
					Если ПодразделенияТекст = "" Тогда
						ПодразделенияТекст = Строка(Подразделение);
					Иначе
						ПодразделенияТекст = СтрШаблон("%1, %2", 
							ПодразделенияТекст,
							Подразделение);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			НайденнаяСтрока.ПодразделенияСтрокой = ПодразделенияТекст;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКлючевыеДолжности()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлючевыеДолжностиКадровогоРезерва.Должность КАК Должность,
		|	КлючевыеДолжностиКадровогоРезерва.Подразделение КАК Подразделение
		|ИЗ
		|	РегистрСведений.КлючевыеДолжностиКадровогоРезерва КАК КлючевыеДолжностиКадровогоРезерва
		|ИТОГИ ПО
		|	Должность";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДолжность = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДолжность.Следующий() Цикл
		ВыборкаСтрок = ВыборкаДолжность.Выбрать();
		НоваяСтрока = КлючевыеДолжности.Добавить();
		НоваяСтрока.Должность = ВыборкаДолжность.Должность;
		
		Пока ВыборкаСтрок.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаСтрок.Подразделение) Тогда
				НоваяСтрока.Подразделения.Добавить(ВыборкаСтрок.Подразделение);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредставленияПодразделений()
	
	Для Каждого Строка Из КлючевыеДолжности Цикл
		КоличествоПодразделений = Строка.Подразделения.Количество();
		Если КоличествоПодразделений = 0 Тогда
			Строка.ПодразделенияСтрокой = НСтр("ru = 'Все подразделения'");
		ИначеЕсли КоличествоПодразделений >= 5 Тогда
			Строка.ПодразделенияСтрокой = СтрШаблон(НСтр("ru = '%1 подразделений'"), КоличествоПодразделений);
		Иначе
			ПодразделенияТекст = "";
			Для Каждого Подразделение Из Строка.Подразделения Цикл
				Если ПодразделенияТекст = "" Тогда
					ПодразделенияТекст = Строка(Подразделение);
				Иначе
					ПодразделенияТекст = СтрШаблон("%1, %2", 
						ПодразделенияТекст,
						Подразделение);
				КонецЕсли;
			КонецЦикла;
			Строка.ПодразделенияСтрокой = ПодразделенияТекст;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КлючевыеДолжностиПередУдалениемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	КлючевыеДолжности.Удалить(ДополнительныеПараметры.ТекущиеДанные);
	ЗаписатьКлючевыеДолжности();
	
КонецПроцедуры

#КонецОбласти
